print("*****************", end="\n")
print("*               *")
print("*               *")
print("*****************", end="\n")


a = int(input())  # Напишите программу, которая считывает два целых числа 
b = int(input())
print("Квадрат суммы", a, "и", b, "равен", (a + b) ** 2)
print("Сумма квадратов", a, "и", b, "равна", (a**2) + (b**2))


a = int(input())  # Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования. Напишите программу, которая считывает четыре целых положительных числа
b = int(input())
c = int(input())
d = int(input())
print(a**b + c**d)


a = int(input())  # Напишите программу, которая считывает натуральное число
print((a * 1) + (a * 11) + (a * 111), sep="")
